app/views/articles/index.html.slim


.row
  .columns.large-12
    - if @articles.size > 0
      ul.articles
        - @articles.each do |article|
          li = link_to article.title, article_path(article)
    - else
      p No articles has been added, just add some anonymous ones ;-)
---
SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"