app/controllers/articles_controller.rb

    def create
      @article = Article.new(article_params)
      if @article.save
---
INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Le martin"], ["content", "Il est fort"], ["created_at", "2015-10-13 10:19:45.028373"], ["updated_at", "2015-10-13 10:19:45.028373"]]

    def update
      @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "L'article de la muerte"], ["content", "![Her RW his oral skills are on point](http://i.imgur.com/gmhu398.gif)"], ["updated_at", "2015-10-13 11:03:55.445295"], ["id", 12]]